---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.StructAnalyticalErrorProjection
source: html/2a484abb-2177-3863-f59e-e8af104f16d6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.StructAnalyticalErrorProjection Property

Can't project Analytical Model to Analytical Projection Surface

## Syntax (C#)
```csharp
public static FailureDefinitionId StructAnalyticalErrorProjection { get; }
```